from typing import Optional, Type


NO_RIGHTS = "❌ У вас немає необхідних прав для виконання цієї дії. Відсутність прав адміністрування."
CHAT_NOT_CONFIGURED = "❌ Чат ще не налаштований, використовуйте команду /init для базової конфігурації"

ONLY_IN_PRIVATE = "💬 Ця дія доступна лише в особистому листуванні з ботом! Будь ласка, почніть чат зі мною."
ONLY_IN_GROUP = "💬 Ця дія доступна лише в групових чатах! Будь ласка, скористайтеся цією командою в групі."

CHATS_NOT_FOUND = """
🔎 Немає чатів, де Ви були б Адміністратором!

💡 Додайте мене в чат, що потребує модерації, і спробуйте знову.
"""

BOT_YOUR_CHATS = "📑 Ось усі чати, до яких Ви маєте доступ для модерації:"

BOT_CHATS_DETAILS = """
<b>🔹 Назва:</b> <b>{chat_title}</b>
<b>🔹 Тип:</b> <b>{chat_type}</b>
<b>🔹 ID:</b> <b>{chat_id}</b>
<b>🔹 Кількість учасників:</b> <b>{chat_user_count}</b>

⏩ Виберіть, що хочете зробити:
"""

BOT_EDIT_CHAT_MOD_SETTINGS = "⚙️ Виберіть групу налаштувань для редагування:"

START_PRIVATE = """
🌟 Вітаю, <b>{username}</b>!

Я, <b>YuliManager</b>, ваш помічник для модерації чатів і каналів.

Я створений для модерації каналів проекту <b>YukiManga 🇺🇦</b>, але з радістю допоможу й іншим! 😊

Для детальної інформації використовуйте команду <b>/help</b>.
"""

START_OTHER_MOD_DISABLED = """
❗ Привіт, <b>{username}</b>!

Модерація ще не налаштована в цьому чаті. Потрібно, щоб хтось з адміністраторів налаштував її.
"""

START_OTHER_MOD_ENABLED = """
👍 Привіт, <b>{username}</b>!

Модерація в цьому чаті увімкнена. Я стежу за порядком та готовий допомогти! 😊
"""
BOT_INIT_START_SETUP = "🔧 Починаю налаштування... Будь ласка, зачекайте."
BOT_INIT_SUCCESS = "✅ Первісна ініціалізація та додавання адміністраторів пройшли <b>успішно!</b>"
ACTION_NOT_ALLOWED = "Цю дію неможливо виконати тут."
ACTION_NOT_ALLOWED_TIMER = "Цю дію неможливо виконати тут. Спробуйте через: {time}"

INVALID_LINK = "<b>❌ Недійсне посилання:</b> Перевірте, чи правильно вказано посилання та спробуйте ще раз."
LINK_ALREADY_IN_WHITELIST = "<b>ℹ️ Посилання вже є у списку виключень:</b>"
LINK_NOT_IN_WHITELIST = "<b>❌ Посилання відсутнє у списку виключень:</b> Можливо, ви ввели неправильну адресу. Перевірте та спробуйте ще раз."


CHAT_TYPE_GROUP = "Група"
CHAT_TYPE_SUPERGROUP = "Група"
CHAT_TYPE_CHANNEL = "Канал"
CHAT_TYPE_PRIVATE = "Особисті"

YES = "Так"
LINK = "Посилання"
NONE = "Немає"
NO = "Ні"
ON = "Увімкнути"
OFF = "Вимкнути"

RULES_ON_WELCOME = "Правила при вході"
ENABLED = "Увімкнено"
BLOCK_ALL = "Блокувати всі"
WHITE_LIST = "Винятки"
BAN = "Блокування"
WARN = "Попередження"
MUTE = "Заткнути"
PUNISHENT = "Покарання"
PUNISHENT_DURATION = "Час покарання"

WELCOME_RULES_ACCEPT = "Приймаю правила"


DELETE = "Видалити"
ADD = "Додати"
BACK = "Назад"
EDIT = "Редагувати"
EDIT_BASIC = "Основні"
EDIT_NOTIFY = "Повідомлення"
EDIT_BAN_WORDS = "Заборонені слова"
EDIT_BAN_LINKS = "Заборонені посилання"


CHAT_EDIT_BASIC = """
<b>🔧 Модерація</b>

Модерація у чаті: <b>{is_mod_on}</b>  
<em>Включена або вимкнена модерація для чату</em>
"""

CHAT_EDIT_NOTIFY = """
<b>📩 Сповіщення про нових учасників</b>

Нові учасники: <b>{is_new_member_on}</b>  
<em>Включені сповіщення про нових учасників чату</em>
"""

CHAT_RULES_SETTINGS = """
<b>⚙️ Налаштування правил при вході</b>

<b>📝 Правила при вході:</b> <b>{is_rules_enabled}</b>
<em>Включена система прийняття правил при вході</em>

<b>📃 Посилання на правила:</b> <a href="{rules_link}">Переглянути правила</a>

<b>⏳ Таймер на прийняття:</b> <b>2 хвилини</b>
<em>Користувачам потрібно ознайомитись із правилами, почекати 2 хвилини, після чого натиснути "Прийняти правила". Після цього вони отримають доступ до чату.</em>
"""


CHAT_EDIT_RESTRICTED_WORDS = """
<b>🚫 Заборонені слова</b>

Блокування за забороненими словами: <b>{is_ban_word_on}</b>  
<em>Чи активована система для блокування учасників за використання заборонених слів</em>

<b>⚖️ Покарання:</b>
- Тип покарання: <b>{punishment_type}</b>
- Тривалість покарання: <b>{punishment_duration}</b>
- Попереджень перед покаранням: <b>{punishment_warns_count}</b>
<em>Налаштування покарань за порушення</em>
"""

CHAT_EDIT_RESTRICTED_LINKS = """
<b>🔗 Заборона посилань</b>

Можна заборонити всі посилання або дозволити деякі (наприклад, особисті медіа чи важливу інформацію).

<b>Поточні налаштування:</b>
- Чи активовано блокування: <b>{is_mod_on}</b>
- Блокувати всі посилання: <b>{ban_all_links}</b>
- Список дозволених посилань: <b>{whitelist_label}</b>
<em>Налаштування для контролю посилань у чаті</em>
"""

CHAT_EDIT_RESTRICTED_LINKS_WHITELIST = """
<b>🔗 Заборона посилань: виключення</b>

Ви можете додати виключення — посилання, які не будуть блокуватися у чаті. Це дозволить залишати важливі або дозволені ресурси доступними для учасників.

<b>Поточний список виключень:</b> {whitelist_links}
"""

CHAT_EDIT_RESTRICTED_LINKS_WHITELIST_ADD = """
<b>🔗 Додавання виключень</b>

Щоб додати посилання до списку виключень, використовуйте команду:  
<code>/add_link [посилання]</code>  
Наприклад: <code>/add_link https://example.com</code>  
"""

CHAT_EDIT_RESTRICTED_LINKS_WHITELIST_DELETE = """
<b>🔗 Видалення виключень</b>

Щоб видалити посилання зі списку виключень, використовуйте команду:  
<code>/remove_link [посилання]</code>  
Наприклад: <code>/remove_link https://example.com</code>  

Список актуальних виключень: {whitelist_links}
"""


CHAT_EDIT_RW_SELECT_PUNISHMENT_TYPE = """
<b>🔒 Вибір типу покарання</b>

<em>Виберіть тип покарання за порушення. Воно буде застосовуватися після {punishment_warns_count} попереджень:</em>

- 🔒 <b>Блокування</b>
- 🌐 <b>Заткнути</b>
"""

CHAT_EDIT_RW_SELECT_PUNISHMENT_DURATION = """
<b>🕐 Вибір тривалості покарання</b>

<em>Час, на який буде виконано покарання.</em>

<b>Поточне покарання:</b> {punishment_type}
<b>Попереджень перед покаранням:</b> {punishment_warns_count}

🔗 <b>Відправте повідомлення з тривалістю покарання у форматі:</b> 
<code>1h30m</code> - 1 година, 30 хвилин

<b>Доступні мітки:</b>
- 🗓 <b>m</b> - Хвилини
- ⏰ <b>h</b> - Години
- 📅 <b>d</b> - Дні
"""

MUTED_WARNING = """
❌ Ви були замучені за використання заборонених слів у повідомленні.

Ви зможете писати через <b>{time_left}</b>.
"""

ALREADY_MUTED = """
❌ Ви вже замучені. Ваш м'ют буде знятий через <b>{time_left}</b>.
"""

BANNED_WARNING = """
❌ Ви були заблоковані за використання заборонених слів у повідомленні.

Ви зможете писати через <b>{time_left}</b>.
"""

ALREADY_BANNED = """
❌ Ви вже заблоковані. Ваш бан буде знятий через <b>{time_left}</b>.
"""

MUTE_COMMAND_INVALID_FORMAT = """
<b>❌ Невірний формат команди!</b>

Будь ласка, використовуйте формат:
<code>/mute {час} {причина}</code>

Приклад: <code>/mute 1h30m Спам</code>
"""


COMMAND_ARGS_INSUFFICIENT = """
<b>❌ Недостатньо аргументів для виконання команди!</b>

Будь ласка, перевірте правильність введення команди.
Очікувані аргументи: <b>{expected_args}</b>.
"""

COMMAND_ARG_INVALID_TYPE = """
<b>❌ Невірний формат аргументу #{arg_number}!</b>

Очікуваний тип: <b>{expected_type}</b>.
Отримане значення: <code>{received_value}</code>.
"""


COMMAND_NO_REPLY = """
<b>❌ Помилка!</b>

Ви повинні відповісти на повідомлення користувача.
"""

USER_NOT_MUTED = """
<b>❌ Помилка!</b>

<b>Користувач не замучений.</b>
"""
USER_NOT_BANNED = """
<b>❌ Помилка!</b>

<b>Користувач не заблокований.</b>
"""
USER_NOT_WARNED = """
<b>❌ Помилка!</b>

<b>У користувача немає попереджень.</b>
"""

UNMUTE_COMMAND_SUCCESS = "<b>✅ Мут було знято з користувача {username}</b>"
UNBAN_COMMAND_SUCCESS = "<b>✅ Блокування було знято з користувача {username}</b>"
UNWARN_COMMAND_SUCCESS = "<b>✅ Попередження було знято з користувача {username}</b>"



WARN_COMMAND_SUCCESS_ADMIN = """
<b>✅ Користувач отримав попередження!</b>

<b>Користувач:</b> {username}
<b>Причина:</b> {reason}
<b>Попереджень:</b> {warn_count}
"""


MUTE_COMMAND_SUCCESS_ADMIN = """
<b>✅ Користувач успішно замучений!</b>

<b>Користувач:</b> {username}
<b>Тривалість:</b> {duration}
<b>Причина:</b> {reason}
"""

MUTE_COMMAND_SUCCESS_USER = """
<b>🔇 Ви були замучені!</b>

<b>Тривалість:</b> {duration}
<b>Причина:</b> {reason}
<b>Розблокування через:</b> {time_until_unmute}
"""

MUTE_COMMAND_ADMIN_CANNOT_MUTE = """
🚫 <b>Помилка:</b> Ви не можете замутити адміністратора цього чату.
"""
BAN_COMMAND_ADMIN_CANNOT_BAN = """
🚫 <b>Помилка:</b> Ви не можете забанити адміністратора цього чату.
"""

NEW_USER_WELCOME = """
👋 Вітаємо в каналі, <b>{username}</b>!

Ми раді бачити вас серед нас. Ознайомтесь, будь ласка, з правилами і насолоджуйтесь спілкуванням!

Якщо виникнуть питання, сміливо звертайтесь до адміністраторів або використовуйте команду <b>/help</b>.
"""

WELCOME_NOT_YOUR_RULE = "⚠️ Це повідомлення не стосується вас."
WELCOME_ALREADY_READ = "⏳ Ви ще не витратили достатньо часу на ознайомлення з правилами. Будь ласка, дочекайтеся завершення таймера. Залишилось: {time_left}"
WELCOME_RULES_ACCEPTED = "✅ Дякуємо, що ознайомилися з правилами! Тепер ви можете спілкуватися в нашій спільноті."
WELCOME_READ_RULES_FIRST = "⚠️ Ви повинні спочатку ознайомитися з правилами, перш ніж підтвердити їх."


NEW_USER_WELCOME_RULES = """
👋 Вітаємо в каналі, <b>{username}</b>!

Ми раді бачити вас серед нас! Перед початком спілкування, будь ласка, ознайомтеся з <b>правилами</b> нашої спільноти. Після ознайомлення натисніть кнопку «Приймаю правила».

⚠️ Натискаючи «Приймаю правила», ви погоджуєтесь дотримуватись встановлених норм. У разі порушення правил адміністрація залишає за собою право вжити відповідних заходів.

<b>Правила:</b> {rules_url}

⬇️ Натисніть кнопку нижче, щоб підтвердити:
"""


USER_FAREWELL = """
👋 Прощавай, <b>{username}</b>!

Ми будемо сумувати за тобою. Якщо захочеш повернутися, двері завжди відкриті! Бережи себе та до зустрічі!
"""

RESTRICTED_WORD_WARNING = """
<b>⚠️ Увага!</b>

Ви використовували заборонені слова у цьому чаті. 
<b>Попередження:</b> {current_warn_count} з {max_warn_count}
<b>Тип покарання:</b> {punishment_type}

Будь ласка, дотримуйтесь правил спільноти, щоб уникнути подальших покарань.
"""

def type_locale(tp: Type) -> str:
    return {
        int: "Ціле число",
        float: "Дійсне число",
        str: "Рядок",
        bool: "Булеве значення",
        list: "Список",
        dict: "Словник"
    }.get(tp, "Рядок")

def punish_type(ptype: str) -> str:
    return {
        'ban': BAN,
        "mute": MUTE
    }.get(ptype)


def yes_no(value: bool) -> str:
    return YES if value else NO



def has_link(link: Optional[str] = None) -> str:
    if link:
        return f'<a href="{link}">{LINK}</a>'
    else:
        return NONE
